Sample Service Combined/testcase/Casin_Fina_3/iteration2/.$iteration2.trace/request.log

POST /Casin_Final_ServiceService/FinalService HTTP/1.0
X-Bridge: NoErrorReturn
Request-ID: iteration2_1738196941204
SOAPAction: 
User-Agent: SOAPTestTool/1.0 (Java HotSpot(TM) 64-Bit Server VM/25.92-b14)
Host: localhost:11924
Content-Length: 1154
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:ns0="urn:Services.FinalExercise.FinalExerciseService.FinalService"
              xmlns:bridge="http://e2e.ch/bridge"
              xmlns:ns1="urn:Services.SOAPDateTranslator.Classes"
              xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
   <env:Header>
      <bridge:Trace level="None" maxSize="10"/>
   </env:Header>
   <env:Body>
      <ns0:iteration2>
         <inputParam soapenc:arrayType="ns1:inputData[1]" xsi:type="soapenc:Array">
            <item0 xsi:type="ns1:inputData">
               <id xsi:type="xsd:integer">123</id>
               <name xsi:type="xsd:string">Clark John Casin</name>
               <age xsi:type="xsd:string">24</age>
               <address xsi:type="xsd:string">Manila</address>
               <birthdate xsi:type="xsd:string">12/01/2000</birthdate>
               <company xsi:type="xsd:string">Onetool</company>
               <salary xsi:type="xsd:float">1</salary>
               <years_hired xsi:type="xsd:integer">1</years_hired>
               <language xsi:type="xsd:string">PH</language>
            </item0>
         </inputParam>
      </ns0:iteration2>
   </env:Body>
</env:Envelope>